"""Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме: название, форма
собственности, выручка, издержки.

Пример строки файла: firm_1 ООО 10000 5000.

Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль. Если фирма получила
убытки, в расчет средней прибыли ее не включать. Далее реализовать список. Он должен содержать словарь с фирмами и их
прибылями, а также словарь со средней прибылью. Если фирма получила убытки, также добавить ее в словарь (со значением
убытков).

Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий файл.

Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]

Подсказка: использовать менеджеры контекста."""

import json
from statistics import mean

with open('lesson5/5-7.txt', 'r', encoding='UTF-8') as file:
    content = file.readlines()

revenue = {firm.split()[0]: int(firm.split()[-2]) - int(firm.split()[-1]) for firm in content}
average = {'average_profit': mean(x for x in list(revenue.values()) if x > 0)}

with open('lesson5/5-7.json', 'w', encoding='UTF-8') as file:
    json.dump([revenue, average], file)
